## 4장 2절

In [1]:
a1 = 3
A1 = 4
a1 + A1

7

In [2]:
x = 'Apple Pie'
x

'Apple Pie'

In [3]:
for i in [1,2,3,4]:
    print(i)

1
2
3
4

In [4]:
for i in [1,2,3,4]:
    if(i % 2 == 0):
        print('짝수')
    else: 
        print('홀수')

홀수
짝수
홀수
짝수

In [5]:
for i in [1,2,3,4]:
    print('짝수') if i % 2 == 0 else print('홀수')

홀수
짝수
홀수
짝수

In [6]:
def sum_a_b(a=1, b=1):
    return a+b

In [7]:
sum_a_b()

2

In [8]:
sum_a_b(3, 5)

8

In [9]:
import pandas as pd

In [10]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [11]:
len(obj)

4

In [12]:
type(obj)

pandas.core.series.Series

In [13]:
obj[0]

4

In [14]:
obj[0:2]

0    4
1    7
dtype: int64

In [15]:
obj[obj > 0]

0    4
1    7
3    3
dtype: int64

In [16]:
r = obj == [4, 7, 5, 3] 
r

0     True
1     True
2    False
3     True
dtype: bool

In [17]:
all(r)

False

In [18]:
any(r)

True

In [19]:
del obj[0]
obj

1    7
2   -5
3    3
dtype: int64

In [20]:
from numpy import nan as NA

data = {'ID': [1,2,3,4,5],
        'name': ['Kim', 'Choi', 'Park', NA, 'Lee'],
        'class': [1,1,1,2,2],
        'score': [100, NA, 92, 70, 80]}

df = pd.DataFrame(data)
df

   ID  name  class  score
0   1   Kim      1  100.0
1   2  Choi      1    NaN
2   3  Park      1   92.0
3   4   NaN      2   70.0
4   5   Lee      2   80.0

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   name    4 non-null      object
 2   class   5 non-null      int64
 3   score   4 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 288.0+ bytes

In [22]:
df[df.score > 80]

   ID  name  class  score
0   1   Kim      1  100.0
2   3  Park      1   92.0

In [23]:
df.score

0    100.0
1      NaN
2     92.0
3     70.0
4     80.0
Name: score, dtype: float64

In [24]:
s = df['score']
s

0    100.0
1      NaN
2     92.0
3     70.0
4     80.0
Name: score, dtype: float64

In [25]:
type(s)

pandas.core.series.Series

In [26]:
df[['ID', 'score']]

   ID  score
0   1  100.0
1   2    NaN
2   3   92.0
3   4   70.0
4   5   80.0

In [27]:
df.index = ['A', 'B', 'C', 'D', 'E']
df

   ID  name  class  score
A   1   Kim      1  100.0
B   2  Choi      1    NaN
C   3  Park      1   92.0
D   4   NaN      2   70.0
E   5   Lee      2   80.0

In [28]:
df.iloc[1, [0,3]]

ID         2
score    NaN
Name: B, dtype: object

In [29]:
df.iloc[1:3, [0,3]]

   ID  score
B   2    NaN
C   3   92.0

In [30]:
df.loc['A', ['ID', 'score']]

ID           1
score    100.0
Name: A, dtype: object

In [31]:
df.loc[['A', 'D'], ['ID', 'score']]

   ID  score
A   1  100.0
D   4   70.0

In [32]:
df.loc[['A', 'D'], :]

   ID name  class  score
A   1  Kim      1  100.0
D   4  NaN      2   70.0

In [33]:
df.isnull().sum()

ID       0
name     1
class    0
score    1
dtype: int64

In [34]:
df.score.isnull().sum()

1

In [35]:
df.score.notnull().sum()

4

In [36]:
df.dropna()

   ID  name  class  score
A   1   Kim      1  100.0
C   3  Park      1   92.0
E   5   Lee      2   80.0

In [37]:
df.dropna(subset=['score'])

   ID  name  class  score
A   1   Kim      1  100.0
C   3  Park      1   92.0
D   4   NaN      2   70.0
E   5   Lee      2   80.0

In [38]:
df2 = df.dropna(subset=['score'])
df2
# df.dropna(subset=['score'], inplace = True)

   ID  name  class  score
A   1   Kim      1  100.0
C   3  Park      1   92.0
D   4   NaN      2   70.0
E   5   Lee      2   80.0

In [39]:
df.name.fillna('Unknown')

A        Kim
B       Choi
C       Park
D    Unknown
E        Lee
Name: name, dtype: object

In [40]:
df.fillna({'name': 'Unknown', 'score': df.score.mean()}, inplace=True)
df

   ID     name  class  score
A   1      Kim      1  100.0
B   2     Choi      1   85.5
C   3     Park      1   92.0
D   4  Unknown      2   70.0
E   5      Lee      2   80.0

In [41]:
test_df = pd.DataFrame(data)
print('test_df : \n', test_df)
copied1 = test_df # df와 동일하게 변화 
copied2 = test_df.copy() # df의 원본 보존

test_df.dropna(subset=['score'], inplace = True)
print('변화된 df : \n', test_df)
print('copy를 활용 안 함 : \n', copied1)
print('copy를 활용 : \n', copied2)

test_df :
    ID  name  class  score
0   1   Kim      1  100.0
1   2  Choi      1    NaN
2   3  Park      1   92.0
3   4   NaN      2   70.0
4   5   Lee      2   80.0
변화된 df :
    ID  name  class  score
0   1   Kim      1  100.0
2   3  Park      1   92.0
3   4   NaN      2   70.0
4   5   Lee      2   80.0
copy를 활용 안 함 :
    ID  name  class  score
0   1   Kim      1  100.0
2   3  Park      1   92.0
3   4   NaN      2   70.0
4   5   Lee      2   80.0
copy를 활용 :
    ID  name  class  score
0   1   Kim      1  100.0
1   2  Choi      1    NaN
2   3  Park      1   92.0
3   4   NaN      2   70.0
4   5   Lee      2   80.0

In [42]:
df['diff'] = df.score - df.score.mean()
df['new_score'] = [98, 90, 80, 85, 70]
df

   ID     name  class  score  diff  new_score
A   1      Kim      1  100.0  14.5         98
B   2     Choi      1   85.5   0.0         90
C   3     Park      1   92.0   6.5         80
D   4  Unknown      2   70.0 -15.5         85
E   5      Lee      2   80.0  -5.5         70

In [43]:
df.loc[:, 'diff2'] = df.score - df.score.mean()
df

   ID     name  class  score  diff  new_score  diff2
A   1      Kim      1  100.0  14.5         98   14.5
B   2     Choi      1   85.5   0.0         90    0.0
C   3     Park      1   92.0   6.5         80    6.5
D   4  Unknown      2   70.0 -15.5         85  -15.5
E   5      Lee      2   80.0  -5.5         70   -5.5

In [44]:
df.rename(columns = {'diff' : 'mean_diff', 'diff2': 'mean_diff2'}, inplace=True)
df

   ID     name  class  score  mean_diff  new_score  mean_diff2
A   1      Kim      1  100.0       14.5         98        14.5
B   2     Choi      1   85.5        0.0         90         0.0
C   3     Park      1   92.0        6.5         80         6.5
D   4  Unknown      2   70.0      -15.5         85       -15.5
E   5      Lee      2   80.0       -5.5         70        -5.5

In [45]:
df.columns

Index(['ID', 'name', 'class', 'score', 'mean_diff', 'new_score', 'mean_diff2'], dtype='object')

In [46]:
df.drop(['mean_diff', 'mean_diff2'], axis=1)

   ID     name  class  score  new_score
A   1      Kim      1  100.0         98
B   2     Choi      1   85.5         90
C   3     Park      1   92.0         80
D   4  Unknown      2   70.0         85
E   5      Lee      2   80.0         70

In [47]:
del df['mean_diff2']
df.columns

Index(['ID', 'name', 'class', 'score', 'mean_diff', 'new_score'], dtype='object')

In [48]:
df.groupby('class').score.mean()

class
1    92.5
2    75.0
Name: score, dtype: float64

In [49]:
df[['class', 'score', 'new_score']].groupby('class').mean()

       score  new_score
class
1       92.5  89.333333
2       75.0  77.500000

## 4장 3절

In [50]:
data = {'class': [1,2,3,4,5],
        'teacher': ['moon', 'lee', 'park', 'choi', 'jung']}
name = pd.DataFrame(data)

exam_new = pd.merge(df, name, on='class', how='left')
exam_new

   ID     name  class  score  mean_diff  new_score teacher
0   1      Kim      1  100.0       14.5         98    moon
1   2     Choi      1   85.5        0.0         90    moon
2   3     Park      1   92.0        6.5         80    moon
3   4  Unknown      2   70.0      -15.5         85     lee
4   5      Lee      2   80.0       -5.5         70     lee

## 알아두면 좋아요 : Python의 자료형 (리스트, 튜플, 딕셔너리)

In [51]:
# 리스트

int_list = [1, 2, 3, 10]
int_list

[1, 2, 3, 10]

In [52]:
sum(int_list)

16

In [53]:
hetero_list = ['string', 0.1, str(2), True]  # str은 정수나 실수를 문자열 형태로 바꿔줌
hetero_list

['string', 0.1, '2', True]

In [54]:
len(hetero_list)

4

In [55]:
int_list[1]

2

In [56]:
int_list[1:3]

[2, 3]

In [57]:
int_list[1:]

[2, 3, 10]

In [58]:
int_list[2:]

[3, 10]

In [59]:
copy1 = int_list[:]
copy1

[1, 2, 3, 10]

In [60]:
copy2 = int_list
int_list[3] = 4
print('copy1 :', copy1)
print('copy2 :', copy2)

copy1 : [1, 2, 3, 10]
copy2 : [1, 2, 3, 4]

In [61]:
# 튜플

my_list = [1, 2]
my_tuple = (1, 2)
print(type(my_list))
print(type(my_tuple))

<class 'list'>
<class 'tuple'>

In [62]:
other_tuple = 3, 4
other_tuple

(3, 4)

In [63]:
# 에러 발생 
# other_tuple[0] = 1

In [64]:
# 딕셔너리 

grades = {'math' : 100, 'science' : 90}
grades

{'math': 100, 'science': 90}

In [65]:
type(grades)

dict

In [66]:
grades['math']

100

In [67]:
grades['attitude'] = [80, 100, 95]
grades

{'math': 100, 'science': 90, 'attitude': [80, 100, 95]}